<a href="https://colab.research.google.com/github/Mrcwr2/Python_Excel_Clean_Data/blob/main/8_End__Splitting_text_to_columns.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Splitting text to columns
---

## **Excel:**

*   Ribbon: Data -> Data Tools -> Text to Columns

![text-to-columns.png]()

## **Python:**



*   Use .str.split(separator=' ', expand=True) on series
*   Separator argument has many options (' ', '_', ':', etc...)
*   Assign new column names


    df['column_to_split'].str.split(' ', expand=True)

<br>

<br>

### Load required packages and data
---

In [ ]:
# Import required packages
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
# Save Github location paths to a variable
failed_bank_path = 'https://github.com/The-Calculated-Life/python_analysis_for_excel/blob/main/data/failed_banks.xlsx?raw=true'
bx_users_path = 'https://raw.githubusercontent.com/The-Calculated-Life/python_analysis_for_excel/main/data/bx_users.csv'

# Read excel and CSV files
bank_dividends = pd.read_excel(failed_bank_path, sheet_name='dividends')
bx_users = pd.read_csv(bx_users_path)

<br>

### Example: Splitting one column into several
---

In [ ]:
# Look at dividends data
bank_dividends.head()

               Bank Number:Name:Date Closed  ...  Date Paid
0  10000:METROPOLITAN SAVINGS BANK:2/2/2007  ... 2012-07-06
1  10000:METROPOLITAN SAVINGS BANK:2/2/2007  ... 2007-10-23
2             10001:NETBANK, FSB :9/28/2007  ... 2018-03-22
3             10001:NETBANK, FSB :9/28/2007  ... 2015-06-11
4             10001:NETBANK, FSB :9/28/2007  ... 2014-05-08

[5 rows x 6 columns]

<br>

In [ ]:
# Select the appropriate series
bank_dividends['Bank Number:Name:Date Closed']

0             10000:METROPOLITAN SAVINGS BANK:2/2/2007
1             10000:METROPOLITAN SAVINGS BANK:2/2/2007
2                        10001:NETBANK, FSB :9/28/2007
3                        10001:NETBANK, FSB :9/28/2007
4                        10001:NETBANK, FSB :9/28/2007
                             ...
1930    6005:UNIVERSAL FEDERAL SAVINGS BANK :6/27/2002
1931               6006:DOLLAR SAVINGS BANK :2/14/2004
1932               6006:DOLLAR SAVINGS BANK :2/14/2004
1933               6006:DOLLAR SAVINGS BANK :2/14/2004
1934               6006:DOLLAR SAVINGS BANK :2/14/2004
Name: Bank Number:Name:Date Closed, Length: 1935, dtype: object

<br>

In [ ]:
# Split the data (without expand)
bank_dividends['Bank Number:Name:Date Closed'].str.split(':')

0            [10000, METROPOLITAN SAVINGS BANK, 2/2/2007]
1            [10000, METROPOLITAN SAVINGS BANK, 2/2/2007]
2                       [10001, NETBANK, FSB , 9/28/2007]
3                       [10001, NETBANK, FSB , 9/28/2007]
4                       [10001, NETBANK, FSB , 9/28/2007]
                              ...
1930    [6005, UNIVERSAL FEDERAL SAVINGS BANK , 6/27/2...
1931              [6006, DOLLAR SAVINGS BANK , 2/14/2004]
1932              [6006, DOLLAR SAVINGS BANK , 2/14/2004]
1933              [6006, DOLLAR SAVINGS BANK , 2/14/2004]
1934              [6006, DOLLAR SAVINGS BANK , 2/14/2004]
Name: Bank Number:Name:Date Closed, Length: 1935, dtype: object

<br>

In [ ]:
# Split the data (and expand)
bank_dividends['Bank Number:Name:Date Closed'].str.split(':', expand=True)

          0                                1          2
0     10000        METROPOLITAN SAVINGS BANK   2/2/2007
1     10000        METROPOLITAN SAVINGS BANK   2/2/2007
2     10001                    NETBANK, FSB   9/28/2007
3     10001                    NETBANK, FSB   9/28/2007
4     10001                    NETBANK, FSB   9/28/2007
...     ...                              ...        ...
1930   6005  UNIVERSAL FEDERAL SAVINGS BANK   6/27/2002
1931   6006             DOLLAR SAVINGS BANK   2/14/2004
1932   6006             DOLLAR SAVINGS BANK   2/14/2004
1933   6006             DOLLAR SAVINGS BANK   2/14/2004
1934   6006             DOLLAR SAVINGS BANK   2/14/2004

[1935 rows x 3 columns]

<br>

In [ ]:
# Save the result to three columns 'Bank Number', 'Name', 'Date Closed'
bank_dividends[['Bank Number', 'Name', 'Date Closed']] = bank_dividends['Bank Number:Name:Date Closed'].str.split(':', expand=True)

<br>

In [ ]:
# View the result
bank_dividends.head()

               Bank Number:Name:Date Closed  ... Date Closed
0  10000:METROPOLITAN SAVINGS BANK:2/2/2007  ...    2/2/2007
1  10000:METROPOLITAN SAVINGS BANK:2/2/2007  ...    2/2/2007
2             10001:NETBANK, FSB :9/28/2007  ...   9/28/2007
3             10001:NETBANK, FSB :9/28/2007  ...   9/28/2007
4             10001:NETBANK, FSB :9/28/2007  ...   9/28/2007

[5 rows x 9 columns]

<br><br>
##### **QUICK CHALLENGE #1: Text to columns**

**Task: Split the `location` column of `bx_users` into new columns `[['city', 'region_state', 'country']]`.**

In [ ]:
# Your code for quick challenge #1 here:
bx_users[['city', 'region_state', 'country']] = bx_users['location'].str.split(',', expand=True)

In [ ]:
# View the result
bx_users.head()

   user_id  ...          country
0        1  ...              usa
1        2  ...              usa
2        3  ...           russia
3        4  ...         portugal
4        5  ...   united kingdom

[5 rows x 6 columns]

In [ ]:
/